/*********************************************************************************************************
* Ä£¿éÃû³Æ: UltraSound.c
* Õª    Òª: ³¬ÉùÄ£¿é
* µ±Ç°°æ±¾: 1.0.0
* ×÷    Õß: SZLY(COPYRIGHT 2019 SZLY. All rights reserved.)
* Íê³ÉÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ÄÚ    ÈÝ: 
* ×¢    Òâ: 
**********************************************************************************************************
* È¡´ú°æ±¾: ¸6ÃÄ£¿éÒý½Å£ºÍâ²¿·µ»Ø Echo-PB0,´¥·¢IO Trig-PB1
* ×÷    Õß: 
* Íê³ÉÈÕÆÚ: 
* ÐÞ¸ÄÄÚÈÝ: 
* ÐÞ¸ÄÎÄ¼þ: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              °üº¬Í·ÎÄ¼þ
*********************************************************************************************************/
#include "UltraSound.h"
#include <stm32f10x_conf.h>
#include "SysTick.h"

/*********************************************************************************************************
*                                              ºê¶¨Òå
*********************************************************************************************************/

/*********************************************************************************************************
*                                              Ã¶¾Ù½á¹¹Ìå¶¨Òå
*********************************************************************************************************/

/*********************************************************************************************************
*                                              ÄÚ²¿±äÁ¿
*********************************************************************************************************/
static StructUltraSound s_structDistanceProc;
static float distance=0;
static u8 i_flag=0;
/*********************************************************************************************************
*                                              ÄÚ²¿º¯ÊýÉùÃ÷
*********************************************************************************************************/
static  void  ConfigUltraSoundGPIO(void); //ÅäÖÃUltrasonicµÄGPIO

/*********************************************************************************************************
*                                              ÄÚ²¿º¯ÊýÊµÏÖ
*********************************************************************************************************/
/*********************************************************************************************************
* º¯ÊýÃû³Æ: ConfigUltraSoundGPIO
* º¯Êý¹¦ÄÜ: ÅäÖÃUltrasonicµÄGPIO
* ÊäÈë²ÎÊý: void 
* Êä³ö²ÎÊý: void
* ·µ »Ø Öµ: void
* ´´½¨ÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ×¢    Òâ: ¸ÃÄ£¿éÒý½Å£ºÍâ²¿·µ»Ø Echo-PB1,´¥·¢IO Trig-PB0
*********************************************************************************************************/
static  void  ConfigUltraSoundGPIO(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;                  //GPIO_InitStructureÓÃÓÚ´æ·ÅGPIOµÄ²ÎÊý

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); //Ê¹ÄÜGPIOBÊ±ÖÓ

  //Echo-PB1
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;           //ÉèÖÃÒý½Å
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPD;        //ÉèÖÃI/OÊä³öËÙ¶È
  GPIO_Init(GPIOB, &GPIO_InitStructure);                //ÉèÖÃÊä³öÀàÐÍ
  GPIO_ResetBits(GPIOB, GPIO_Pin_0);                    //¸ù¾Ý²ÎÊý³õÊ¼»¯GPIO
                                                        
  //Trig
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;           //ÉèÖÃÒý½Å
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;      //ÉèÖÃI/OÊä³öËÙ¶È
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;     //ÉèÖÃÊä³öÀàÐÍ
  GPIO_Init(GPIOB, &GPIO_InitStructure);                //¸ù¾Ý²ÎÊý³õÊ¼»¯GPIO   				// ³õÊ¼»¯NVIC
}


/*********************************************************************************************************
*                                              APIº¯ÊýÊµÏÖ
*********************************************************************************************************/
/*********************************************************************************************************
* º¯ÊýÃû³Æ: InitUltraSound
* º¯Êý¹¦ÄÜ: ³õÊ¼»¯³¬ÉùÄ£¿é
* ÊäÈë²ÎÊý: void
* Êä³ö²ÎÊý: void
* ·µ »Ø Öµ: void
* ´´½¨ÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ×¢    Òâ: 
*********************************************************************************************************/
void InitUltraSound(void)
{

  ConfigUltraSoundGPIO();
  TIM_Cmd(TIM3, ENABLE);
  s_structDistanceProc.sta = 0;
  s_structDistanceProc.val = 0;

  GPIO_ResetBits(GPIOB, GPIO_Pin_1);   //´¥·¢IO TrigÖÃµÍµçÆ½
}

/*********************************************************************************************************
* º¯ÊýÃû³Æ: MeasuresDistance
* º¯Êý¹¦ÄÜ: ¿ªÆô³¬Éù²â¾à
* ÊäÈë²ÎÊý: void
* Êä³ö²ÎÊý: void
* ·µ »Ø Öµ: void
* ´´½¨ÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ×¢    Òâ: ³¬Éù²âµÄ¾àÀëµ¥Î»ÊÇcm
*********************************************************************************************************/
void MeasureDistance(void)
{
  GPIO_SetBits(GPIOB, GPIO_Pin_1);
  DelayNus(15);
  GPIO_ResetBits(GPIOB, GPIO_Pin_1);
}

/*********************************************************************************************************
* º¯ÊýÃû³Æ: GetUltraSoundFlg
* º¯Êý¹¦ÄÜ: »ñÈ¡³¬Éù½á¹¹ÌåµØÖ·
* ÊäÈë²ÎÊý: void
* Êä³ö²ÎÊý: void
* ·µ »Ø Öµ: void
* ´´½¨ÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ×¢    Òâ: ³¬Éù²âµÄ¾àÀëµ¥Î»ÊÇcm
*********************************************************************************************************/
StructUltraSound *GetUltraSoundFlg(void)
{
  return &s_structDistanceProc;
}

/*********************************************************************************************************
* º¯ÊýÃû³Æ: GetDistance
* º¯Êý¹¦ÄÜ: ¿ªÆôÒ»´Î³¬Éù²â¾à£¬²¢·µ»Ø½á¹û
* ÊäÈë²ÎÊý: void
* Êä³ö²ÎÊý: void
* ·µ »Ø Öµ: carFlag->distance£¬³¬Éù²â¾à½á¹û
* ´´½¨ÈÕÆÚ: 2019Äê08ÔÂ01ÈÕ
* ×¢    Òâ: ³¬Éù²âµÄ¾àÀëµ¥Î»ÊÇcm
*********************************************************************************************************/
u8 Readi_flag2(void){
  return i_flag;
}


void seti_flag2(u8 th){
  i_flag=th;
}


u8 GetDistance(void)
{
  u8 i = 0;
  MeasureDistance();                                         //¿ªÆôÒ»´Î³¬Éù²â¾à

  //µÈ´ý³¬Éù²â¾à½á¹û
  while ((0 == (s_structDistanceProc.sta & 0x80)) && i < 35) //×î¶à35msµÈ´ý
  {
    i++;
    DelayNms(1);
  }
  i_flag=1;
  return (int)distance;                                  //·µ»Ø³¬Éù²âÊÔ½á¹û
}



void TIM3_IRQHandler(void)
{
 
  if(TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)       //¸üÐÂÖÐ¶Ï
  {
    if(0 == (s_structDistanceProc.sta&0X80))	                    //»¹Î´³É¹¦²¶»ñ
    {
      if(s_structDistanceProc.sta & 0x40)	                        //ÒÑ¾­²¶»ñµ½¸ßµçÆ½ÁË
      {
        if(0x3F == (s_structDistanceProc.sta & 0x3F))             //¼ÆÊ±Æ÷´æ´¢ÒÑ´ï×î´óÖµ
        {
          s_structDistanceProc.sta |= 0x80;                       //Ç¿ÖÆ½ÓÊÕÍê³É
          s_structDistanceProc.val = 0xFFFF;                      //ÊäÈë²¶»ñÖµÉèÎª×î´óÖµ
          
          //¼ÆËã³¬Éù²â¾à½á¹û
          distance = (s_structDistanceProc.sta & 0X3F) * 65536 + s_structDistanceProc.val;
          distance = (float)distance * 170.0 / 10000.0;
          s_structDistanceProc.sta = 0;			                      //¿ªÆôÏÂÒ»´Î²¶»ñ
          s_structDistanceProc.val = 0;
        }
        else
        {
          s_structDistanceProc.sta++;                             //¼ÆÊ±Æ÷×ÔÔö
        }
      }
    }
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);           //Çå³ýÖÐ¶Ï±êÖ¾Î»
  }

  if (TIM_GetITStatus(TIM3, TIM_IT_CC3) != RESET)         //·¢Éú²¶»ñÊÂ¼þ
  {

    if (s_structDistanceProc.sta & 0x40)                          //²¶×½µ½Ò»¸öÏÂ½µÑØ
    {
      s_structDistanceProc.sta |= 0x80;                           //ÊäÈë²¶»ñ½ÓÊÕÍê³É
      s_structDistanceProc.val = TIM_GetCapture3(TIM3);           //»ñÈ¡ÊäÈë²¶»ñÖµ
      TIM_OC3PolarityConfig(TIM3, TIM_ICPolarity_Rising); //ÉèÖÃÎªÉÏÉýÑØ²¶»ñ
      
      //¼ÆËã³¬Éù²â¾à½á¹û
      distance = (s_structDistanceProc.sta & 0X3F) * 65536 + s_structDistanceProc.val;
      distance = (float)distance * 170.0 / 10000.0;
      s_structDistanceProc.sta = 0;			                          //¿ªÆôÏÂÒ»´Î²¶»ñ
      s_structDistanceProc.val = 0;
    }
    else                                                  //µÚÒ»´Î²¶»ñÉÏÉýÑØ
    {
      s_structDistanceProc.sta = 0;                               //Çå¿ÕÊäÈë²¶»ñ±êÖ¾
      s_structDistanceProc.val = 0;                               //Çå¿ÕÊäÈë²¶»ñÖµ
      TIM_SetCounter(TIM3, 0);                            //ÉèÖÃTIM3µÄCNTÎª0
      s_structDistanceProc.sta |= 0x40;                           //±ê¼Ç²¶»ñµ½ÁËÉÏÉýÑØ
      TIM_OC3PolarityConfig(TIM3, TIM_ICPolarity_Falling);//ÉèÖÃÎªÏÂ½µÑØ²¶»ñ
    }

    TIM_ClearITPendingBit(TIM3, TIM_IT_CC3);
  }
}
